package students.student_svetlana_seda.lesson_9.homework.level_3.task_9;

abstract class AbstractClass {
     /*
     Что такое абстрактный класс?
     Абстрактный класс – это класс, содержащий методы, которые не имеют реализации-
     class, который объявляется abstract.

     Можно ли создать экземпляр абстрактного класса в момент выполнения программы?
     Создавать экземпляры абстрактного класса нельзя.
     Суть абстрактного класса заключается в том, что он не завершён, и его нужно завершить в классах-наследниках.
     То есть этот класс не готов к использованию
     */

}

